# Python_seminar

# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть

n=int(input("Введите количество монет:"))
countA = countB = 0
for i in range(n):
    x=int(input("Орел(1) или Решка(0)?"))
    if x == 1:
        countA += 1
    else:
        countB += 1
if countA < countB:
    print('Переверните {countA} монет с орла на решку')
else:
    print('Переверните {countB} монет с решки на орла')


# Задача 12: Петя и Катя – брат и сестра. Петя – студентка, а Катя – школьница. Петя помогает Кате по математике. Он считает два числа чисел X и Y (X,Y≤1000), и Катя должна их отгадать. Для этого Петя делает две подсказки. Он доверяет количеству этих чисел S и их произведению P. Помогите Кейт отгадать задуманные Петей числа.

x = int(input("Введите сумму:"))
y = int(input("Введите произведение:"))
for i in range(x):
    for j in range(y):
        if x == i + j and y == i * j:
            print(i, j)

# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.


N = abs(int(input('Введите число N ')))
stop = 0
P = 2
for i in range(N):
    if stop != 1:
        P = P ** i
        if P <= N:
            print(P, end=' ')
            P = 2
        else:
            stop = 1
    else:
        i = N
